diary/20241020-1518.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/diary/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/diary">
<title>バッファ内のテキストをAIに喋らせる</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org/config/diary">ホーム</a><a href="https://www.p-snow.org/config/diary/about.html">あばうと</a><a href="https://www.p-snow.org/config/diary/rss.xml">RSS</a></nav><h1>ティンカラー日記</h1><p>こなゆき(a.k.a. p-snow)</p></header></div>
<div id="content">
<div class="post-date">20 Oct 2024</div><h1 class="post-title"><a href="https://www.p-snow.org/config/diary/20241020-1518.html">バッファ内のテキストをAIに喋らせる</a></h1>
<p>
<preview>
Emacs内のテキストをマシンに喋らせるということは、これまでもけっこう拘ってやってきました。いくつか理由はあります。自分が弱視なのでスクリーンリーダー代わりに使いたいという欲求もありましたし、他のことに目を使っている間に耳で情報を摂取したいというズボラな動機もありました。
</preview>
</p>

<p>
最近では、難しい英単語のより正確な発音を知りたいというのもあります。まあ、ブラウザ内で検索すればGoogle先生が即座にその願いを叶えてくれますが、バッファ内で完結するのがEmacserの矜持というものです。はい。
</p>

<p>
AIブーム前夜まではローカルに用意したエンジンに喋ってもらっていました。<a href="https://p-snow.org/config/dotfiles.html#emacs-tts-old">日本語なら OpenJTalk に、英語なら Festival に。</a>
</p>

<p>
しかし今や、音声合成の技術の発達とともに、AIの力で行われる圧倒的な構文解釈能力をベースにして驚くほどに人間に近い発話が可能になりました。なので、API経由でリージョン内のテキストをChatGPTに喋らせる<a href="https://p-snow.org/config/dotfiles.html#emacs-package-tts">コードを書きました</a>。
</p>

<p>
<details><summary>Elisp Code for Text to Speech</summary><p>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">tts-openai-request</span> (api-key input action)
  <span style="font-style: italic;">"Return audio file content from OpenAI API and save it to OUTPUT-FILE or play it.</span>
<span style="font-style: italic;">INPUT is the text string sent to the API.</span>
<span style="font-style: italic;">RESPONSE-FORMAT is the format of the audio file, defaults to '</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">mp3</span><span style="font-style: italic;">'.</span>
<span style="font-style: italic;">ACTION is either 'save or 'play, determining what to do with the response."</span>
  (<span style="font-weight: bold;">let*</span> ((auth-value (format <span style="font-style: italic;">"Bearer %s"</span> api-key))
         (model <span style="font-style: italic;">"tts-1"</span>)
         (voice <span style="font-style: italic;">"nova"</span>)
         (speed nil)
         (response-format <span style="font-style: italic;">"opus"</span>)
         (url <span style="font-style: italic;">"https://api.openai.com/v1/audio/speech"</span>)
         (data (json-encode `((<span style="font-style: italic;">"model"</span> . ,model)
                              (<span style="font-style: italic;">"input"</span> . ,input)
                              (<span style="font-style: italic;">"voice"</span> . ,voice)
                              ,@(<span style="font-weight: bold;">when</span> response-format `((<span style="font-style: italic;">"response_format"</span> . ,response-format)))
                              ,@(<span style="font-weight: bold;">when</span> speed `((<span style="font-style: italic;">"speed"</span> . ,speed)))))))
    (request
      url
      <span style="font-weight: bold;">:type</span> <span style="font-style: italic;">"POST"</span>
      <span style="font-weight: bold;">:data</span> data
      <span style="font-weight: bold;">:headers</span> `((<span style="font-style: italic;">"Authorization"</span> . ,auth-value) (<span style="font-style: italic;">"Content-Type"</span> . <span style="font-style: italic;">"application/json"</span>))
      <span style="font-weight: bold;">:parser</span> 'buffer-string
      <span style="font-weight: bold;">:success</span> (<span style="font-weight: bold;">cl-function</span>
                (<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;key</span> data <span style="font-weight: bold; text-decoration: underline;">&amp;allow-other-keys</span>)
                  (<span style="font-weight: bold;">let</span> ((coding-system-for-write 'binary)
                        (speech-file (make-temp-file <span style="font-style: italic;">"tts-"</span> nil <span style="font-style: italic;">".opus"</span>)))
                    (<span style="font-weight: bold;">with-temp-file</span> speech-file
                      (insert data))
                    (<span style="font-weight: bold;">when</span> action (funcall action speech-file)))))
      <span style="font-weight: bold;">:error</span> (<span style="font-weight: bold;">cl-function</span>
              (<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;key</span> error-thrown <span style="font-weight: bold; text-decoration: underline;">&amp;allow-other-keys</span>)
                (message <span style="font-style: italic;">"Error: %S"</span> error-thrown))))))
</pre>
</div>
<p>
</p></details>
</p>

<p>
はい。書き方を見ればおわかりのとおり、ちゃっかりパッケージ化を目論んだ書き方になってますね。もしご所望の方がおられましたらご一報ください。がんばってみます。
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/diary/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/diary/tag-ai.html">ai</a> <a href="https://www.p-snow.org/config/diary/tag-speech.html">speech</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
